# Polyloop Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Polyloop Methods
Polyloop Class See Also
---
The Polyloop type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ComputeArea | Gets the area for this polygon. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetPoints | Gets the array of points in the polygon. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
Polyloop Class
Autodesk.Revit.DB.Analysis Namespace